{
  "file_id": "conv_002",
  "duration": 111.98,
  "language": "hinglish",
  "scam_type": "relative_emergency",
  "voices": {
    "victim": "en-IN-NeerjaNeural",
    "scammer": "hi-IN-SwaraNeural"
  },
  "genders": {
    "victim": "female",
    "scammer": "female"
  },
  "segments": [
    {
      "start": 0.0,
      "end": 1.44,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "Hello?",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 2.11,
      "end": 8.77,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Namaste Madam, this is Rahul calling from the security department of State Bank of India. Am I speaking with Mrs. Sharma?",
      "voice": "hi-IN-SwaraNeural"
    },
    {
      "start": 9.35,
      "end": 11.92,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "Haan, bol rahi hoon. What is it?",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 12.49,
      "end": 25.8,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Madam, we've detected some suspicious activity on your debit card. Two unauthorized transactions are showing up – one for ten thousand rupees at a Flipkart store, and another for five thousand at some Zomato place. Did you make these transactions?",
      "voice": "hi-IN-SwaraNeural"
    },
    {
      "start": 26.12,
      "end": 30.34,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "Nahin, nahin! I haven't bought anything online today. This is… this is worrying.",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 30.86,
      "end": 42.16,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Exactly, Madam. That's why I'm calling. To block your card immediately and prevent further fraudulent transactions, we need to verify your identity. Can you please confirm the last four digits of your debit card number?",
      "voice": "hi-IN-SwaraNeural"
    },
    {
      "start": 43.09,
      "end": 46.6,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "Um… okay. Just a second… it's… four, seven, two, nine.",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 47.37,
      "end": 58.41,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Thank you, Madam. Now, for security reasons, a One-Time Password, an OTP, has been sent to your registered mobile number. Please tell me that OTP, so we can secure your account.",
      "voice": "hi-IN-SwaraNeural"
    },
    {
      "start": 58.73,
      "end": 67.98,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "Wait, wait, wait… OTP? But, Rahul, why do you need the OTP? Isn’t that for *me* to authorize transactions? This sounds… a bit strange.",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 68.37,
      "end": 85.85,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Madam, I understand your concern, but this is a security protocol. We need to verify it's really you who's on the phone. It's only for verification purposes, trust me. Otherwise, those fifteen thousand rupees will be gone, and potentially more! Jaldi kijiye, Madam, the OTP is only valid for a few minutes.",
      "voice": "hi-IN-SwaraNeural"
    },
    {
      "start": 86.27,
      "end": 96.06,
      "speaker": "VICTIM",
      "role": "victim",
      "text": "No… I… I don't know. I think I’m going to call the bank directly to check on this. Thank you for letting me know about the suspicious activity.",
      "voice": "en-IN-NeerjaNeural"
    },
    {
      "start": 96.44,
      "end": 111.24,
      "speaker": "SCAMMER",
      "role": "scammer",
      "text": "Madam, please listen! You are wasting precious time! If you call the bank now, it will take ages to get through, and by then it will be too late! Madam, trust me, I am trying to help you. The OTP...",
      "voice": "hi-IN-SwaraNeural"
    }
  ]
}